def task_1():
    a=int(input())
    b=float(input())
    c=str(input()) 
    d=list(input()) 
    e=bool(input()) 
       
    print("Тип переменной a:",type(a))  
    print("Тип переменной b:",type(b))  
    print("Тип переменной c",type(c))  
    print("Тип переменной d:",type(d))  
    print("Тип переменной e:",type(e))  
task_1()

#------------------------------------------------------------------------------------------------------ 

def task_2():
    a=[1,2,3,5,8,13,21]
    print(a[0:3],type(a))
    print("Это последовательность Фибоначи")
task_2()

#------------------------------------------------------------------------------------------------------

from math import *
def task_3():
    a=int(input())
    print(pow(a,2))
task_3()

